#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/gamersnote/gamersnote/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/gamersnote/gamersnote

To view this run in a browser, visit:
https://app.terraform.io/app/happyfukumoto/gamersnote/runs/run-urXj1nV9j5D7gqRQ

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.ecs.aws_iam_role.ecs_task_role: Refreshing state... [id=ecs_task_role]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=gamersnote-api]
module.ecs.aws_iam_policy.ecs_task_policy: Refreshing state... [id=arn:aws:iam::455000526485:policy/ecs_task_policy]
module.vpc.module.aws_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b912a34575a4253a]
module.ecs.aws_iam_policy.ecs_task_ex_policy: Refreshing state... [id=arn:aws:iam::455000526485:policy/ecs_task_ex_policy]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:cluster/gamersnote]
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ap-northeast-1:455000526485:certificate/00a8ad21-ff76-4da4-845e-df28678f7b2b]
module.ecs.aws_iam_role.ecs_task_ex_role: Refreshing state... [id=ecs_task_ex_role]
module.vpc.module.aws_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e81ff7ec6af5af90]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=gamersnote-app]
module.ecs.aws_iam_policy_attachment.ecs_task_policy_attach: Refreshing state... [id=ecs_task_policy_attach]
module.ecs.aws_ecs_task_definition.api: Refreshing state... [id=gamersnote-api]
module.ecs.aws_iam_policy_attachment.ecs_task_ex_policy_attach: Refreshing state... [id=ecs_task_ex_policy_attach]
module.acm.aws_route53_record.this["gamersnote.com"]: Refreshing state... [id=Z05181772U0208ZLB3AL8__8206226daa44e7e47b445ae8273d8106.gamersnote.com._CNAME]
module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2020-12-18 12:55:48 +0000 UTC]
module.ecs.aws_security_group.this: Refreshing state... [id=sg-05f0ddf40cf30e7c3]
module.vpc.module.aws_vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0038bf597d7fa3342]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-00a0a573a96120ec3]
module.vpc.module.aws_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0999cbab79b0169de]
module.vpc.module.aws_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01901d747fa38dd39]
module.vpc.module.aws_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-086a526a8e2940105]
module.vpc.module.aws_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07153c3f6cb0fcc1f]
module.vpc.module.aws_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-007848b304bba0120]
module.vpc.module.aws_vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03d35f9d7f8e1d1b1]
module.vpc.module.aws_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0eb1a678d2b5eae2d]
module.vpc.module.aws_vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06d189796c3405612]
module.vpc.module.aws_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd0e858ac8458eb4]
module.vpc.module.aws_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01901d747fa38dd391080289494]
module.alb.module.aws_alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:loadbalancer/app/gamersnote-alb/d9ddc26d4c0823a6]
module.vpc.module.aws_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-037f7097ace0bc71b]
module.vpc.module.aws_vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0455706d64301bbcf]
module.vpc.module.aws_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07153c3f6cb0fcc1f1080289494]
module.alb.module.aws_alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274]
module.alb.aws_route53_record.this: Refreshing state... [id=Z05181772U0208ZLB3AL8_gamersnote.com_A]
module.alb.module.aws_alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/3e2ab12ba64b7f72]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:service/gamersnote/gamersnote-api]
module.alb.module.aws_alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/b8a513befb65e349]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rds.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "gamersnote-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgresql"
      + engine_version                        = "12.4"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "gamersnote-db"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres12"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + timezone                              = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "gamersnote-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-007848b304bba0120",
          + "subnet-03d35f9d7f8e1d1b1",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @happyfukumoto, Action: `pull_request`*